martinschalk/roboticscode/Servo/SW/ServoMotor/ServoMotor.cydsn/Generated_Source/PSoC5/TIMER.c
/*******************************************************************************
* Function Name: TIMER_ReadControlRegister
********************************************************************************
*
* Summary:
*  Reads the control register and returns it's value.
*
* Parameters:
*  void
*
* Return:
*  The contents of the control register
*
*******************************************************************************/
uint8 TIMER_ReadControlRegister(void) 
{
    return ((uint8)TIMER_CONTROL);
}


/*******************************************************************************
* Function Name: TIMER_WriteControlRegister
********************************************************************************
*
* Summary:
*  Sets the bit-field of the control register.
*
* Parameters:
*  control: The contents of the control register
*
* Return:
*
*******************************************************************************/
void TIMER_WriteControlRegister(uint8 control) 
{
    TIMER_CONTROL = control;
}
#endif /* Remove API if control register is removed */


/*******************************************************************************
* Function Name: TIMER_ReadPeriod
********************************************************************************
*
* Summary:
*  This function returns the current value of the Period.
*
* Parameters:
*  void
*
* Return:
*  The present value of the counter.
*
*******************************************************************************/
uint32 TIMER_ReadPeriod(void) 
{
   #if(TIMER_UsingFixedFunction)
       return ((uint32)CY_GET_REG16(TIMER_PERIOD_LSB_PTR));
   #else
       return (CY_GET_REG32(TIMER_PERIOD_LSB_PTR));
   #endif /* (TIMER_UsingFixedFunction) */
}


/*******************************************************************************
* Function Name: TIMER_WritePeriod
********************************************************************************
*
* Summary:
*  This function is used to change the period of the counter.  The new period
*  will be loaded the next time terminal count is detected.
*
* Parameters:
*  period: This value may be between 1 and (2^Resolution)-1.  A value of 0 will
*          result in the counter remaining at zero.
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_WritePeriod(uint32 period) 
{
    #if(TIMER_UsingFixedFunction)
        uint16 period_temp = (uint16)period;
        CY_SET_REG16(TIMER_PERIOD_LSB_PTR, period_temp);
    #else
        CY_SET_REG32(TIMER_PERIOD_LSB_PTR, period);
    #endif /*Write Period value with appropriate resolution suffix depending on UDB or fixed function implementation */
}


/*******************************************************************************
* Function Name: TIMER_ReadCapture
********************************************************************************
*
* Summary:
*  This function returns the last value captured.
*
* Parameters:
*  void
*
* Return:
*  Present Capture value.
*
*******************************************************************************/
uint32 TIMER_ReadCapture(void) 
{
   #if(TIMER_UsingFixedFunction)
       return ((uint32)CY_GET_REG16(TIMER_CAPTURE_LSB_PTR));
   #else
       return (CY_GET_REG32(TIMER_CAPTURE_LSB_PTR));
   #endif /* (TIMER_UsingFixedFunction) */
}


/*******************************************************************************
* Function Name: TIMER_WriteCounter
********************************************************************************
*
* Summary:
*  This funtion is used to set the counter to a specific value
*
* Parameters:
*  counter:  New counter value.
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_WriteCounter(uint32 counter) \
                                   
{
   #if(TIMER_UsingFixedFunction)
        /* This functionality is removed until a FixedFunction HW update to
         * allow this register to be written
         */
        CY_SET_REG16(TIMER_COUNTER_LSB_PTR, (uint16)counter);
        
    #else
        CY_SET_REG32(TIMER_COUNTER_LSB_PTR, counter);
    #endif /* Set Write Counter only for the UDB implementation (Write Counter not available in fixed function Timer */
}


/*******************************************************************************
* Function Name: TIMER_ReadCounter
********************************************************************************
*
* Summary:
*  This function returns the current counter value.
*
* Parameters:
*  void
*
* Return:
*  Present compare value.
*
*******************************************************************************/
uint32 TIMER_ReadCounter(void) 
{

    /* Force capture by reading Accumulator */
    /* Must first do a software capture to be able to read the counter */
    /* It is up to the user code to make sure there isn't already captured data in the FIFO */
    (void)TIMER_COUNTER_LSB;

    /* Read the data from the FIFO (or capture register for Fixed Function)*/
    #if(TIMER_UsingFixedFunction)
        return ((uint32)CY_GET_REG16(TIMER_CAPTURE_LSB_PTR));
    #else
        return (CY_GET_REG32(TIMER_CAPTURE_LSB_PTR));
    #endif /* (TIMER_UsingFixedFunction) */
}


#if(!TIMER_UsingFixedFunction) /* UDB Specific Functions */

/*******************************************************************************
 * The functions below this point are only available using the UDB
 * implementation.  If a feature is selected, then the API is enabled.
 ******************************************************************************/


#if (TIMER_SoftwareCaptureMode)


/*******************************************************************************
* Function Name: TIMER_SetCaptureMode
********************************************************************************
*
* Summary:
*  This function sets the capture mode to either rising or falling edge.
*
* Parameters:
*  captureMode: This parameter sets the capture mode of the UDB capture feature
*  The parameter values are defined using the
*  #define TIMER__B_TIMER__CM_NONE 0
#define TIMER__B_TIMER__CM_RISINGEDGE 1
#define TIMER__B_TIMER__CM_FALLINGEDGE 2
#define TIMER__B_TIMER__CM_EITHEREDGE 3
#define TIMER__B_TIMER__CM_SOFTWARE 4
 identifiers
*  The following are the possible values of the parameter
*  TIMER__B_TIMER__CM_NONE        - Set Capture mode to None
*  TIMER__B_TIMER__CM_RISINGEDGE  - Rising edge of Capture input
*  TIMER__B_TIMER__CM_FALLINGEDGE - Falling edge of Capture input
*  TIMER__B_TIMER__CM_EITHEREDGE  - Either edge of Capture input
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_SetCaptureMode(uint8 captureMode) 
{
    /* This must only set to two bits of the control register associated */
    captureMode = ((uint8)((uint8)captureMode << TIMER_CTRL_CAP_MODE_SHIFT));
    captureMode &= (TIMER_CTRL_CAP_MODE_MASK);

    /* Clear the Current Setting */
    TIMER_CONTROL &= ((uint8)(~TIMER_CTRL_CAP_MODE_MASK));

    /* Write The New Setting */
    TIMER_CONTROL |= captureMode;
}
#endif /* Remove API if Capture Mode is not Software Controlled */


