martinschalk/roboticscode/Servo/SW/ServoMotor/ServoMotor.cydsn/Generated_Source/PSoC5/TIMER.c
#if (TIMER_SoftwareTriggerMode)


/*******************************************************************************
* Function Name: TIMER_SetTriggerMode
********************************************************************************
*
* Summary:
*  This function sets the trigger input mode
*
* Parameters:
*  triggerMode: Pass one of the pre-defined Trigger Modes (except Software)
    #define TIMER__B_TIMER__TM_NONE 0x00u
    #define TIMER__B_TIMER__TM_RISINGEDGE 0x04u
    #define TIMER__B_TIMER__TM_FALLINGEDGE 0x08u
    #define TIMER__B_TIMER__TM_EITHEREDGE 0x0Cu
    #define TIMER__B_TIMER__TM_SOFTWARE 0x10u
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_SetTriggerMode(uint8 triggerMode) 
{
    /* This must only set to two bits of the control register associated */
    triggerMode &= TIMER_CTRL_TRIG_MODE_MASK;

    /* Clear the Current Setting */
    TIMER_CONTROL &= ((uint8)(~TIMER_CTRL_TRIG_MODE_MASK));

    /* Write The New Setting */
    TIMER_CONTROL |= (triggerMode | TIMER__B_TIMER__TM_SOFTWARE);

}
#endif /* Remove API if Trigger Mode is not Software Controlled */

#if (TIMER_EnableTriggerMode)


/*******************************************************************************
* Function Name: TIMER_EnableTrigger
********************************************************************************
*
* Summary:
*  Sets the control bit enabling Hardware Trigger mode
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_EnableTrigger(void) 
{
    #if (!TIMER_ControlRegRemoved)   /* Remove assignment if control register is removed */
        TIMER_CONTROL |= TIMER_CTRL_TRIG_EN;
    #endif /* Remove code section if control register is not used */
}


/*******************************************************************************
* Function Name: TIMER_DisableTrigger
********************************************************************************
*
* Summary:
*  Clears the control bit enabling Hardware Trigger mode
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_DisableTrigger(void) 
{
    #if (!TIMER_ControlRegRemoved)   /* Remove assignment if control register is removed */
        TIMER_CONTROL &= ((uint8)(~TIMER_CTRL_TRIG_EN));
    #endif /* Remove code section if control register is not used */
}
#endif /* Remove API is Trigger Mode is set to None */


#if(TIMER_InterruptOnCaptureCount)
#if (!TIMER_ControlRegRemoved)   /* Remove API if control register is removed */


/*******************************************************************************
* Function Name: TIMER_SetInterruptCount
********************************************************************************
*
* Summary:
*  This function sets the capture count before an interrupt is triggered.
*
* Parameters:
*  interruptCount:  A value between 0 and 3 is valid.  If the value is 0, then
*                   an interrupt will occur each time a capture occurs.
*                   A value of 1 to 3 will cause the interrupt
*                   to delay by the same number of captures.
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_SetInterruptCount(uint8 interruptCount) 
{
    /* This must only set to two bits of the control register associated */
    interruptCount &= TIMER_CTRL_INTCNT_MASK;

    /* Clear the Current Setting */
    TIMER_CONTROL &= ((uint8)(~TIMER_CTRL_INTCNT_MASK));
    /* Write The New Setting */
    TIMER_CONTROL |= interruptCount;
}
#endif /* Remove API if control register is removed */
#endif /* TIMER_InterruptOnCaptureCount */


#if (TIMER_UsingHWCaptureCounter)


/*******************************************************************************
* Function Name: TIMER_SetCaptureCount
********************************************************************************
*
* Summary:
*  This function sets the capture count
*
* Parameters:
*  captureCount: A value between 2 and 127 inclusive is valid.  A value of 1
*                to 127 will cause the interrupt to delay by the same number of
*                captures.
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_SetCaptureCount(uint8 captureCount) 
{
    TIMER_CAP_COUNT = captureCount;
}


/*******************************************************************************
* Function Name: TIMER_ReadCaptureCount
********************************************************************************
*
* Summary:
*  This function reads the capture count setting
*
* Parameters:
*  void
*
* Return:
*  Returns the Capture Count Setting
*
*******************************************************************************/
uint8 TIMER_ReadCaptureCount(void) 
{
    return ((uint8)TIMER_CAP_COUNT);
}
#endif /* TIMER_UsingHWCaptureCounter */


/*******************************************************************************
* Function Name: TIMER_ClearFIFO
********************************************************************************
*
* Summary:
*  This function clears all capture data from the capture FIFO
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_ClearFIFO(void) 
{
    while(0u != (TIMER_ReadStatusRegister() & TIMER_STATUS_FIFONEMP))
    {
        (void)TIMER_ReadCapture();
    }
}

#endif /* UDB Specific Functions */


/* [] END OF FILE */
